#pragma once
#include <iostream>
using namespace std;
double table(int k, double a) {
	double num = 0;
	if (a == 0.01) {
		if (k == 1)
			num = 6.6;
		if (k == 2)
			num = 9.2;
		if (k == 3)
			num = 11.3;
		if (k == 4)
			num = 13.3;
		if (k == 5)
			num = 15.1;
		if (k == 6)
			num = 16.8;
		if (k == 7)
			num = 18.5;
		if (k == 8)
			num = 20.1;
		if (k == 9)
			num = 21.7;
		if (k == 10)
			num = 23.2;
		if (k == 11)
			num = 24.7;
		if (k == 12)
			num = 26.2;
		if (k == 13)
			num = 27.7;
		if (k == 14)
			num = 29.1;
		if (k == 15)
			num = 30.6;
		if (k == 16)
			num = 32.0;
		if (k == 17)
			num = 33.4;
		if (k == 18)
			num = 34.8;
		if (k == 19)
			num = 36.2;
		if (k == 20)
			num = 37.6;
		if (k == 21)
			num = 38.9;
		if (k == 22)
			num = 40.3;
		if (k == 23)
			num = 41.6;
		if (k == 24)
			num = 43.0;
		if (k == 25)
			num = 44.3;
		if (k == 26)
			num = 45.6;
		if (k == 27)
			num = 47.0;
		if (k == 28)
			num = 48.3;
		if (k == 29)
			num = 49.6;
		if (k == 30)
			num = 50.9;
	}
	if (a == 0.025) {
		if (k == 1)
			num = 5;
		if (k == 2)
			num = 7.4;
		if (k == 3)
			num = 9.4;
		if (k == 4)
			num = 11.1;
		if (k == 5)
			num = 12.8;
		if (k == 6)
			num = 14.4;
		if (k == 7)
			num = 16;
		if (k == 8)
			num = 17.5;
		if (k == 9)
			num = 19;
		if (k == 10)
			num = 20.5;
		if (k == 11)
			num = 21.9;
		if (k == 12)
			num = 23.3;
		if (k == 13)
			num = 24.7;
		if (k == 14)
			num = 26.1;
		if (k == 15)
			num = 27.5;
		if (k == 16)
			num = 28.8;
		if (k == 17)
			num = 30.2;
		if (k == 18)
			num = 31.5;
		if (k == 19)
			num = 32.9;
		if (k == 20)
			num = 34.2;
		if (k == 21)
			num = 35.5;
		if (k == 22)
			num = 36.8;
		if (k == 23)
			num = 38.1;
		if (k == 24)
			num = 39.4;
		if (k == 25)
			num = 40.6;
		if (k == 26)
			num = 41.9;
		if (k == 27)
			num = 43.2;
		if (k == 28)
			num = 44.5;
		if (k == 29)
			num = 45.7;
		if (k == 30)
			num = 47;
	}
	if (a == 0.05) {
		if (k == 1)
			num = 3.8;
		if (k == 2)
			num = 6;
		if (k == 3)
			num = 7.8;
		if (k == 4)
			num = 9.5;
		if (k == 5)
			num = 11.1;
		if (k == 6)
			num = 12.6;
		if (k == 7)
			num = 14.1;
		if (k == 8)
			num = 15.5;
		if (k == 9)
			num = 16.9;
		if (k == 10)
			num = 18.3;
		if (k == 11)
			num = 19.7;
		if (k == 12)
			num = 21;
		if (k == 13)
			num = 22.4;
		if (k == 14)
			num = 23.7;
		if (k == 15)
			num = 25;
		if (k == 16)
			num = 26.3;
		if (k == 17)
			num = 27.6;
		if (k == 18)
			num = 28.9;
		if (k == 19)
			num = 30.1;
		if (k == 20)
			num = 31.4;
		if (k == 21)
			num = 32.7;
		if (k == 22)
			num = 33.9;
		if (k == 23)
			num = 35.2;
		if (k == 24)
			num = 36.4;
		if (k == 25)
			num = 37.7;
		if (k == 26)
			num = 38.9;
		if (k == 27)
			num = 40.1;
		if (k == 28)
			num = 41.3;
		if (k == 29)
			num = 42.6;
		if (k == 30)
			num = 43.8;
	}
	if (a == 0.95) {
		if (k == 1)
			num = 0.0039;
		if (k == 2)
			num = 0.103;
		if (k == 3)
			num = 0.352;
		if (k == 4)
			num = 0.711;
		if (k == 5)
			num = 1.15;
		if (k == 6)
			num = 1.64;
		if (k == 7)
			num = 2.17;
		if (k == 8)
			num = 2.73;
		if (k == 9)
			num = 3.33;
		if (k == 10)
			num = 3.94;
		if (k == 11)
			num = 4.57;
		if (k == 12)
			num = 5.23;
		if (k == 13)
			num = 5.89;
		if (k == 14)
			num = 6.57;
		if (k == 15)
			num = 7.26;
		if (k == 16)
			num = 7.96;
		if (k == 17)
			num = 8.67;
		if (k == 18)
			num = 9.39;
		if (k == 19)
			num = 10.1;
		if (k == 20)
			num = 10.9;
		if (k == 21)
			num = 11.6;
		if (k == 22)
			num = 12.3;
		if (k == 23)
			num = 13.1;
		if (k == 24)
			num = 13.8;
		if (k == 25)
			num = 14.6;
		if (k == 26)
			num = 15.4;
		if (k == 27)
			num = 16.2;
		if (k == 28)
			num = 16.9;
		if (k == 29)
			num = 17.7;
		if (k == 30)
			num = 18.5;
	}
	if (a == 0.975) {
		if (k == 1)
			num = 0.00098;
		if (k == 2)
			num = 0.051;
		if (k == 3)
			num = 0.216;
		if (k == 4)
			num = 0.484;
		if (k == 5)
			num = 0.831;
		if (k == 6)
			num = 1.24;
		if (k == 7)
			num = 1.69;
		if (k == 8)
			num = 2.18;
		if (k == 9)
			num = 2.7;
		if (k == 10)
			num = 3.25;
		if (k == 11)
			num = 3.82;
		if (k == 12)
			num = 4.4;
		if (k == 13)
			num = 5.01;
		if (k == 14)
			num = 5.63;
		if (k == 15)
			num = 6.26;
		if (k == 16)
			num = 6.91;
		if (k == 17)
			num = 7.56;
		if (k == 18)
			num = 8.23;
		if (k == 19)
			num = 8.91;
		if (k == 20)
			num = 9.59;
		if (k == 21)
			num = 10.3;
		if (k == 22)
			num = 11;
		if (k == 23)
			num = 11.7;
		if (k == 24)
			num = 12.4;
		if (k == 25)
			num = 13.1;
		if (k == 26)
			num = 13.8;
		if (k == 27)
			num = 14.6;
		if (k == 28)
			num = 15.3;
		if (k == 29)
			num = 16;
		if (k == 30)
			num = 16.8;
	}
	if (a == 0.99) {
		if (k == 1)
			num = 0.00016;
		if (k == 2)
			num = 0.02;
		if (k == 3)
			num = 0.115;
		if (k == 4)
			num = 0.297;
		if (k == 5)
			num = 0.554;
		if (k == 6)
			num = 0.872;
		if (k == 7)
			num = 1.24;
		if (k == 8)
			num = 1.65;
		if (k == 9)
			num = 2.09;
		if (k == 10)
			num = 2.56;
		if (k == 11)
			num = 3.05;
		if (k == 12)
			num = 3.57;
		if (k == 13)
			num = 4.11;
		if (k == 14)
			num = 4.66;
		if (k == 15)
			num = 5.23;
		if (k == 16)
			num = 5.81;
		if (k == 17)
			num = 6.41;
		if (k == 18)
			num = 7.01;
		if (k == 19)
			num = 7.63;
		if (k == 20)
			num = 8.26;
		if (k == 21)
			num = 8.9;
		if (k == 22)
			num = 9.54;
		if (k == 23)
			num = 10.2;
		if (k == 24)
			num = 10.9;
		if (k == 25)
			num = 11.5;
		if (k == 26)
			num = 12.2;
		if (k == 27)
			num = 12.9;
		if (k == 28)
			num = 13.6;
		if (k == 29)
			num = 14.3;
		if (k == 30)
			num = 15;
	}
	return num;
}
void menu() {
	system("cls");
	cout << "Выберете конкурирующую гипотезу,на основе которой будет построена задача:" << endl;
	cout << "1.H1:o^2>num" << endl;
	cout << "2.H1:o^2!=num" << endl;
	cout << "3.H1:o^2<num" << endl;
	cout << "0.Выход" << endl;

}
void task(int n, double s, double y, int hypothesis) {
	int k = n - 1;
	double X1, X2, X3;
	int  variant;
	do {
		menu();
		cin >> variant;
		switch (variant)
		{
		case 1:
		{
			cout << "Из нормальной генеральной совокупности извлечена выборка обьема n= " << n << " и по ней найдена исправленная выборочная дисперсия s^2= " << s << ". Требуется при уровне значимости " << y << " проверить нулевую гипотезу H0:o^2=o0^2= " << hypothesis << ", приняв в качестве конкурирующей гипотезы H1:o^2>" << hypothesis << endl;
			cout << "Найдем наблюденное значение критерия:" << endl;
			X1 = ((n - 1) * s) / hypothesis; //Х(набл)
			cout << "X(набл)^2= " << X1 << endl;
			cout << "По условию, конкурирующая гипотеза имеет вид o^2>" << hypothesis << " , поэтому критическая область правосторонняя." << endl;
			X2 = table(k, y); //Х(кр)
			cout << "По таблице, по уровню значимости " << y << " и числу степеней свободы k=" << k << " находим критическую точку X(кр)^2(" << y << ";" << k << ")=" << X2 << endl;
			if (X1 < X2)
				cout << "Так как X(набл)<X(кр) - нет оснований отвергнуть нулевую гипотезу." << endl;
			else
				cout << "Так как X(набл)>X(кр) - нулевая гипотеза отвергнута." << endl;
		}
		break;
		case 2:
		{
			cout << "Из нормальной генеральной совокупности извлечена выборка обьема n= " << n << " и по ней найдена исправленная выборочная дисперсия s^2= " << s << ". Требуется при уровне значимости " << y << " проверить нулевую гипотезу H0:o^2=o0^2= " << hypothesis << ", приняв в качестве конкурирующей гипотезы H1:o^2!=" << hypothesis << endl;
			cout << "Найдем наблюденное значение критерия:" << endl;
			X1 = ((n - 1) * s) / hypothesis;//Х(набл)
			cout << "X(набл)^2= " << X1 << endl;
			cout << "Так как конкурирующая гипотеза имеет вид o^2!=" << hypothesis << " то критическая область - двухсторонняя" << endl;
			X2 = table(k, 1 - y / 2);//Х(лев)
			X3 = table(k, y / 2);//Х(прав)
			cout << "По таблице находим критические точки: левую - X(кр)^2= " << X2 << " и правую - X(кр)^2= " << X3 << endl;
			if (X2 < X1 < X3)
				cout << "Так как наблюдавшееся значение критерия принадлежит области принятия гипотезы (" << X2 << "<" << X1 << "<" << X3 << ") - нет оснований ее отвергнуть." << endl;
			else
				cout << "Так как наблюдавшееся значение критерия не принадлежит области принятия гипотезы (" << X2 << "<" << X1 << "<" << X3 << ") - гипотеза отвергнута." << endl;
		}
		break;
		case 3:
		{
			cout << "Из нормальной генеральной совокупности извлечена выборка обьема n= " << n << " и по ней найдена исправленная выборочная дисперсия s^2= " << s << ". Требуется при уровне значимости " << y << " проверить нулевую гипотезу H0:o^2=o0^2= " << hypothesis << ", приняв в качестве конкурирующей гипотезы H1:o^2<" << hypothesis << endl;
			cout << "Найдем наблюденное значение критерия:" << endl;
			X1 = ((n - 1) * s) / hypothesis;//Х(набл)
			cout << "X(набл)^2= " << X1 << endl;
			cout << "По условию, конкурирующая гипотеза имеет вид o^2>" << hypothesis << " , поэтому критическая область правосторонняя." << endl;
			X2 = table(k, 1 - y);//Х(кр)
			cout << "По таблице, по уровню значимости " << y << " и числу степеней свободы k=" << k << " находим критическую точку X(кр)^2(" << y << ";" << k << ")=" << X2 << endl;
			if (X1 > X2)
				cout << "Так как X(набл)>X(кр) - нет оснований отвергнуть нулевую гипотезу." << endl;
			else
				cout << "Так как X(набл)<X(кр) - нулевая гипотеза отвергнута." << endl;
		}
		break;
		}
		if (variant != 0)
			system("pause");
	} while (variant != 0);
}

int Answer5() {
	setlocale(0, "");
	task(13, 10.3, 0.025, 12);//(об`ем, дисперсия, уровень значимости, зн.гипотезы)



	return 0;
}